{
  "versions": [
    {
      "id": "Version 2.0",
      "date": "2019-03-12",
      "link": "Version-2.0",
      "changes": [
        "Added support for mobile and tablets via responsive layouts, icons, and menuing",
        "Update the look and feel of the website",
        "Replaced the alphabetical listing, season listing, and skill listing with a combined search page",
        "Added an exclusive search to allow searching for items in *only* the selected seasons/skills",
        "Completely re-wrote the data backend to better represent an item being in the same bundle twice",
        "Added support for bundles to have different numbers of an item",
        "Added a link to the bundle button to take you directly to that bundle",
        "Added a reset button to allow you to start a new game",
        "Added checkmarks to completed rooms",
        "Fixed a bug where oak resin was listed twice",
        "Fixed a bug where parsnips have the same id as morels",
        "Switched to using Vuejs single file components",
        "Updated dependencies (vuejs, bulma)"
      ]
    },
    {
      "id": "Version 1.4",
      "date": "2016-04-16",
      "link": "Version-1.4",
      "changes": [
        "Fixed a bug where items skills were always being hidden",
        "Updated Season and Skill tabs to sort alphabetically",
        "Updated to Bulma 0.0.20",
        "Added a text decoration to completed bundles",
        "Fixed a bug with side-panel styling",
        "Reduced the margin size of the room names so they all fit properly in their container.",
        "Updated the bundles nav to be included in 'Hide Completed'",
        "Hide Completed and Hide Spoilers settings are now saved.",
        "Added a more thorough readme."
      ]
    },
    {
      "id": "Version 1.3",
      "date": "2016-04-15",
      "link": "Version-1.3",
      "changes": [
        "Bundles rewards are now hidden with other spoilers.",
        "Added a settings page to allow the user to define what information constitutes spoilers.",
        "Small Layout Changes"
      ]
    },
    {
      "id": "Version 1.2",
      "date": "2016-04-14",
      "link": "Version-1.2",
      "changes": [
        "Added an 'All Season' nav item in the Seasons tab. This shows items that are available in all seasons. Other season tabs now show items that are available in that season and at most 2 others. (#39)"
      ]
    },
    {
      "id": "Version 1.1",
      "date": "2016-04-14",
      "link": "Version-1.1",
      "changes": [
        "Added bundle completion numbers (#40)",
        "'Hide Completed' toggle now hides items in completed bundles, even if the item is not checked. (#44)",
        "Buttons for items in bundles that have been completed, but are not checked are now transparent. (#46)",
        "Updated scripts to load via HTTPS so that users loading Github via HTTPS can use the page (#47)"
      ]
    },
    {
      "id": "Version 1.0",
      "date": "2016-04-13",
      "link": "Version-1.0",
      "changes": [
        "Initial Version"
      ]
    }
  ]
}
